OdGiLinetypeDash.setEmbeddedShape(System.Boolean)
\details
Specifies whether this linetype dash should be an embedded shape.
\param value [in]  Flag that specifies whether this linetype dash should be an embedded shape.

OdGiLinetypeDash.isEmbeddedShape
\details
Checks whether this linetype dash is an embedded shape.
\returns
true if this linetype dash is an embedded shape, false otherwise.

OdGiLinetypeDash.setEmbeddedTextString(System.Boolean)
\details
Specifies whether this linetype dash should be an embedded text string.
\param value [in]  Flag that specifies whether this linetype dash should be an embedded text string.

OdGiLinetypeDash.isEmbeddedTextString
\details
Checks whether this linetype dash is an embedded text string.
\returns
true if this linetype dash is an embedded text string, false otherwise.

OdGiLinetypeDash.setRotationUpright(System.Boolean)
\details
Specifies whether rotation of linetype elements should be upright, i.e. some elements will be drawn upright even if situation requires them to be drawn  upside down or backward (e.g. on circular paths).
\param value [in]  Flag that specifies whether rotation is upright.

OdGiLinetypeDash.isRotationUpright
\details
Checks whether rotation of linetype elements is upright, i.e. some elements which may be required to drawn upside down or backward (e.g. on circular paths) are still drawn upright.
\returns
true if linetype elements are rotated upright, false otherwise.

OdGiLinetypeDash.setRotationAbsolute(System.Boolean)
\details
Specifies whether orientation for the linetype dash should be absolute (UCS-aligned).
\param value [in]  Flag that specifies whether orientation of the dash is absolute.

OdGiLinetypeDash.isRotationAbsolute
\details
Checks whether orientation for the linetype dash is absolute (UCS-aligned).
\returns
true if linetype dash is UCS-aligned, false otherwise.

OdGiLinetypeDash.#ctor
\details
Default constructor for the OdGiLinetypeDash class. Sets the following data members:
Data member           Value     Description
shapeScale            1.0       Scale of a shape
shapeRotation         0.0       Shape rotation
flags                 0         Dash flags that represent whether dash rotation is absolute, whether rotation is upright, etc
shapeOffset           0.0       Shape offset by x and y axes
styleId               NULL      Text style identifier for a text dash

OdGiLinetypeDash.styleId
Text style identifier for a text dash.

OdGiLinetypeDash.textString
Dash as a text string.

OdGiLinetypeDash.shapeOffset
Shape offset.

OdGiLinetypeDash.shapeNumber
Shape number in the ASCII table.

OdGiLinetypeDash.flags
Dash flags that represent whether dash rotation is absolute, whether rotation is upright, etc.

OdGiLinetypeDash.shapeRotation
Shape rotation.

OdGiLinetypeDash.shapeScale
Scale of a shape.

OdGiLinetypeDash.length
Dash length.